app/Helpers/helper.php

select * from `navbar_buttons` where `role_id` is null and `for_guest` = 1 limit 1
---
function getNavbarButton($roleId = null, $forGuest = false)
{
    return \App\Models\NavbarButton::where('role_id', $roleId)
        ->where('for_guest', $forGuest)
        ->first();